<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"0bb28c7b45785d8185eac695a98d688a05eea642e0c0004fdaaf790a23b4bad3","plan_job_ref":"Job Terraform Plan #13 at https://github.com/getsentry/security-cloud-functions-template/actions/runs/13020207249","plan_hash":"b97f42984112c711da2ea8f0d660d730743d4db5eae2df761131fba1edf36e22","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __.__
<details>
<summary>Plan: 11 to add, 4 to change, 4 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrastructure.google_project_iam_member.project_roles["roles/iam.serviceAccounts.create"] will be created
  + resource "google_project_iam_member" "project_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:gha-cloud-functions-deployment@jeffreyhung-test.iam.gserviceaccount.com"
      + project = "jeffreyhung-test"
      + role    = "roles/iam.serviceAccounts.create"
    }

  # module.functions.module.cloud_function["example-gen1"].data.archive_file.source will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "source" {
      + excludes            = [
          + "terraform.yaml",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "/tmp/example-gen1.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "functions/example-gen1"
      + type                = "zip"
    }

  # module.functions.module.cloud_function["example-gen1"].google_cloudfunctions_function.function will be updated in-place
  ~ resource "google_cloudfunctions_function" "function" {
        id                            = "projects/jeffreyhung-test/locations/us-west1/functions/example-gen1"
        name                          = "example-gen1"
      ~ source_archive_object         = "src-18c466ec5779266c94567c27199067dc.zip" -> (known after apply)
        # (28 unchanged attributes hidden)
    }

  # module.functions.module.cloud_function["example-gen1"].google_storage_bucket_object.zip must be replaced
-/+ resource "google_storage_bucket_object" "zip" {
      + content             = (sensitive value)
      ~ crc32c              = "72r8KQ==" -> (known after apply)
      ~ detect_md5hash      = "GMRm7Fd5JmyUVnwnGZBn3A==" -> "different hash"
      - event_based_hold    = false -> null
      ~ generation          = 1724967819961207 -> (known after apply)
      ~ id                  = "********************************************************************************" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "GMRm7Fd5JmyUVnwnGZBn3A==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-18c466ec5779266c94567c27199067dc.zip?generation=1724967819961207&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "src-18c466ec5779266c94567c27199067dc.zip" -> (known after apply) # forces replacement
      ~ output_name         = "src-18c466ec5779266c94567c27199067dc.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-18c466ec5779266c94567c27199067dc.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (7 unchanged attributes hidden)
    }

  # module.functions.module.cloud_function["example-gen1-cron"].data.archive_file.source will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "source" {
      + excludes            = [
          + "terraform.yaml",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "/tmp/example-gen1-cron.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "functions/example-gen1-cron"
      + type                = "zip"
    }

  # module.functions.module.cloud_function["example-gen1-cron"].google_cloudfunctions_function.function will be updated in-place
  ~ resource "google_cloudfunctions_function" "function" {
        id                            = "projects/jeffreyhung-test/locations/us-west1/functions/example-gen1-cron"
        name                          = "example-gen1-cron"
      ~ source_archive_object         = "src-18c466ec5779266c94567c27199067dc.zip" -> (known after apply)
        # (28 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.module.cloud_function["example-gen1-cron"].google_storage_bucket_object.zip must be replaced
-/+ resource "google_storage_bucket_object" "zip" {
      + content             = (sensitive value)
      ~ crc32c              = "72r8KQ==" -> (known after apply)
      ~ detect_md5hash      = "GMRm7Fd5JmyUVnwnGZBn3A==" -> "different hash"
      - event_based_hold    = false -> null
      ~ generation          = 1724967819961207 -> (known after apply)
      ~ id                  = "********************************************************************************" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "GMRm7Fd5JmyUVnwnGZBn3A==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-18c466ec5779266c94567c27199067dc.zip?generation=1724967819961207&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "src-18c466ec5779266c94567c27199067dc.zip" -> (known after apply) # forces replacement
      ~ output_name         = "src-18c466ec5779266c94567c27199067dc.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-18c466ec5779266c94567c27199067dc.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (7 unchanged attributes hidden)
    }

  # module.functions.module.cloud_function["get-gh-app-token"].data.archive_file.source will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "source" {
      + excludes            = [
          + "terraform.yaml",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "/tmp/get-gh-app-token.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "functions/get-gh-app-token"
      + type                = "zip"
    }

  # module.functions.module.cloud_function["get-gh-app-token"].google_cloudfunctions_function.function will be updated in-place
  ~ resource "google_cloudfunctions_function" "function" {
        id                            = "projects/jeffreyhung-test/locations/us-west1/functions/get-gh-app-token"
        name                          = "get-gh-app-token"
      ~ source_archive_object         = "src-989adf691d3a45530f1902481ebe44c2.zip" -> (known after apply)
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.module.cloud_function["get-gh-app-token"].google_storage_bucket_object.zip must be replaced
-/+ resource "google_storage_bucket_object" "zip" {
      + content             = (sensitive value)
      ~ crc32c              = "QD14EQ==" -> (known after apply)
      ~ detect_md5hash      = "mJrfaR06RVMPGQJIHr5Ewg==" -> "different hash"
      - event_based_hold    = false -> null
      ~ generation          = 1738015184436880 -> (known after apply)
      ~ id                  = "********************************************************************************" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "mJrfaR06RVMPGQJIHr5Ewg==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-989adf691d3a45530f1902481ebe44c2.zip?generation=1738015184436880&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "src-989adf691d3a45530f1902481ebe44c2.zip" -> (known after apply) # forces replacement
      ~ output_name         = "src-989adf691d3a45530f1902481ebe44c2.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-989adf691d3a45530f1902481ebe44c2.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (7 unchanged attributes hidden)
    }

  # module.functions.module.cloud_function_gen2["example-gen2-cron"].data.archive_file.source will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "source" {
      + excludes            = [
          + "terraform.yaml",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "/tmp/example-gen2-cron.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "functions/example-gen2-cron"
      + type                = "zip"
    }

  # module.functions.module.cloud_function_gen2["example-gen2-cron"].google_cloudfunctions2_function.function will be updated in-place
  ~ resource "google_cloudfunctions2_function" "function" {
        id               = "projects/jeffreyhung-test/locations/us-west1/functions/example-gen2-cron"
        name             = "example-gen2-cron"
        # (11 unchanged attributes hidden)

      ~ build_config {
            # (7 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "src-03bdfabf8c7adb2ef887fe89f69a0dbe.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.functions.module.cloud_function_gen2["example-gen2-cron"].google_storage_bucket_object.zip must be replaced
-/+ resource "google_storage_bucket_object" "zip" {
      + content             = (sensitive value)
      ~ crc32c              = "GfLWGQ==" -> (known after apply)
      ~ detect_md5hash      = "A736v4x62y74h/6J9poNvg==" -> "different hash"
      - event_based_hold    = false -> null
      ~ generation          = 1724967819858119 -> (known after apply)
      ~ id                  = "********************************************************************************" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "A736v4x62y74h/6J9poNvg==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-03bdfabf8c7adb2ef887fe89f69a0dbe.zip?generation=1724967819858119&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "src-03bdfabf8c7adb2ef887fe89f69a0dbe.zip" -> (known after apply) # forces replacement
      ~ output_name         = "src-03bdfabf8c7adb2ef887fe89f69a0dbe.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-03bdfabf8c7adb2ef887fe89f69a0dbe.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (7 unchanged attributes hidden)
    }

  # module.workflows.module.workflows["example1"].google_cloudfunctions_function_iam_member._["example-gen1"] will be created
  + resource "google_cloudfunctions_function_iam_member" "_" {
      + cloud_function = "example-gen1"
      + etag           = (known after apply)
      + id             = (known after apply)
      + member         = (known after apply)
      + project        = (known after apply)
      + region         = (known after apply)
      + role           = "roles/cloudfunctions.invoker"
    }

  # module.workflows.module.workflows["example1"].google_cloudfunctions_function_iam_member._["example-gen2"] will be created
  + resource "google_cloudfunctions_function_iam_member" "_" {
      + cloud_function = "example-gen2"
      + etag           = (known after apply)
      + id             = (known after apply)
      + member         = (known after apply)
      + project        = (known after apply)
      + region         = (known after apply)
      + role           = "roles/cloudfunctions.invoker"
    }

  # module.workflows.module.workflows["example1"].google_service_account.workflow_sa will be created
  + resource "google_service_account" "workflow_sa" {
      + account_id   = "***********"
      + disabled     = false
      + display_name = "Workflow Service Account for example1"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "jeffreyhung-test"
      + unique_id    = (known after apply)
    }

  # module.workflows.module.workflows["example1"].google_service_account_iam_member.deploy_sa_actas_iam will be created
  + resource "google_service_account_iam_member" "deploy_sa_actas_iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:gha-cloud-functions-deployment@sec-dnr-infra.iam.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.workflows.module.workflows["example1"].google_service_account_iam_member.workflow_sa_actas_iam will be created
  + resource "google_service_account_iam_member" "workflow_sa_actas_iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.workflows.module.workflows["example1"].google_workflows_workflow.workflow will be created
  + resource "google_workflows_workflow" "workflow" {
      + create_time      = (known after apply)
      + description      = "example workflow"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + id               = (known after apply)
      + name             = "example1"
      + name_prefix      = (known after apply)
      + project          = "jeffreyhung-test"
      + revision_id      = (known after apply)
      + service_account  = (known after apply)
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 11 to add, 4 to change, 4 to destroy.
```
</details>

:x: Plan not applied in [Terraform Apply #11](https://github.com/getsentry/security-cloud-functions-template/actions/runs/13020221821) (Plan has changed)